Revit 2025 API
FabricationAncillaryUsageType Enumeration
 An enumerated type describing where an ancillary is used on a fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationAncillaryUsageType
Public Enumeration FabricationAncillaryUsageType
public enum class FabricationAncillaryUsageType
type FabricationAncillaryUsageType
Members
Member name | Value | Description
Undefined | 0 |  Undefined usage.
Loose | 1 |  Miscellaneous loose ancillary defined on the part.
Connector | 2 |  Ancillary makes up a fabrication part connector.
Seam | 3 |  Ancillary is associated with a seam on development(s).
Splitter | 4 |  Ancillary makes up a fabrication part splitter.
Airturn | 5 |  Ancillary makes up a fabrication part airturn or vane.
Hanger | 6 |  Ancillary makes up a fabrication part hanger.
Stiffener | 7 |  Ancillary makes up a fabrication part internal or external stiffener.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace